// NOTE: include #include "usr/local/sega/nn/NNS.hpp" later. I didn't get to do it yet, so replace the NNS stuff here

// total size: 0x10
class NNS_VECTORFAST {
    // Members
public:
    float x; // offset 0x0, size 0x4
    float y; // offset 0x4, size 0x4
    float z; // offset 0x8, size 0x4
    float w; // offset 0xC, size 0x4
};
// total size: 0x10
class Fuid {
    // Members
public:
    unsigned int m_0; // offset 0x0, size 0x4
    unsigned int m_1; // offset 0x4, size 0x4
    unsigned int m_2; // offset 0x8, size 0x4
    unsigned int m_3; // offset 0xC, size 0x4
};
// total size: 0x8
class stcMotionFlgs {
    // Members
public:
    unsigned int u32Flg[2]; // offset 0x0, size 0x8
};
// total size: 0x2C
class stcBasePrfm {
    // Members
public:
    float f32Speed[3]; // offset 0x0, size 0xC
    float f32Accele[3]; // offset 0xC, size 0xC
    float f32RotateSpeed; // offset 0x18, size 0x4
    float f32RotateAccele; // offset 0x1C, size 0x4
    float f32Grip; // offset 0x20, size 0x4
    float f32Durability; // offset 0x24, size 0x4
    unsigned int u32Ability; // offset 0x28, size 0x4
};
// total size: 0x24
class stcData {
    // Members
public:
    char ac8Name_Debug[16]; // offset 0x0, size 0x10
    float f32Height; // offset 0x10, size 0x4
    float f32Weight; // offset 0x14, size 0x4
    unsigned char u8Style; // offset 0x18, size 0x1
    unsigned char u8SkillType; // offset 0x19, size 0x1
    unsigned char u8BaseType; // offset 0x1A, size 0x1
    unsigned char u8Reserve[1]; // offset 0x1B, size 0x1
    float f32AttackLFrame; // offset 0x1C, size 0x4
    float f32AttackRFrame; // offset 0x20, size 0x4
};
enum enmRet {
    VISIBLE_CLIP = 0,
    VISIBLE = 1,
    OUT_VISIBLE = 2,
    OUT_PORTAL = 3,
    OUT_FAR = 4,
};
enum enmModelType {
    MODEL_TYPE_DEF = 0,
    MODEL_TYPE_SKATE_START = 1,
    MODEL_TYPE_ADS = 1,
    MODEL_TYPE_CVS = 2,
    MODEL_TYPE_RLL = 3,
    MODEL_TYPE_SNB = 4,
    MODEL_TYPE_WTD = 5,
    MODEL_TYPE_MAX = 6,
    MODEL_TYPE_SKATE_END = 5,
};
// total size: 0x28
class stcBinInfo {
    // Members
public:
    enum enm ePackId; // offset 0x0, size 0x4
    unsigned char * opu8Bin[6]; // offset 0x4, size 0x18
    unsigned char * opu8BinTopAddr; // offset 0x1C, size 0x4
    unsigned int * opu32OffsetNo; // offset 0x20, size 0x4
    signed int s32RestBinNum; // offset 0x24, size 0x4
};
// total size: 0xC
class NNS_VECTOR {
    // Members
public:
    float x; // offset 0x0, size 0x4
    float y; // offset 0x4, size 0x4
    float z; // offset 0x8, size 0x4
};
float of32BaseHeight; // size: 0x4, address: 0x6651C0
class stcBasePrfm oasBasePrfm[5]; // size: 0xDC, address: 0x6651D0
class stcBasePrfm osWalkPrfm[4]; // size: 0xB0, address: 0x6652B0
class stcData oasData[19]; // size: 0x2AC, address: 0x665360
static unsigned char chk__oasData_SizeCheck_[1]; // size: 0x1, address: 0x0
char * oasCharaCode3[19]; // size: 0x4C, address: 0x620CA0
static unsigned char chk__oasCharaCode3_SizeCheck_[1]; // size: 0x1, address: 0x0
unsigned int oasImageColor[19]; // size: 0x4C, address: 0x6656B0
static unsigned char chk__oasImageColor_SizeCheck_[1]; // size: 0x1, address: 0x0
unsigned int oasImageColorRgb[19]; // size: 0x4C, address: 0x665700
static unsigned char chk__oasImageColorRgb_SizeCheck_[1]; // size: 0x1, address: 0x0
void (* afloadAdditionalFuncs[19])(class stcBinInfo &); // size: 0x4C, address: 0x620CF0
static unsigned char chk__afloadAdditionalFuncs_SizeCheck_[1]; // size: 0x1, address: 0x0
class stcMotionFlgs asMotionFlgsDef[8]; // size: 0x40, address: 0x665750
class stcMotionFlgs asMotionFlgsEgg[8]; // size: 0x40, address: 0x665790
class stcMotionFlgs asMotionFlgsOther[8]; // size: 0x40, address: 0x6657D0
class stcMotionFlgs asMotionFlgsWave[8]; // size: 0x40, address: 0x665810
class stcMotionFlgs asMotionFlgsBily[8]; // size: 0x40, address: 0x665850
static float FLYACTION_DESCENT_PITCH_GRAVITY; // size: 0x4, address: 0x0
static float FLYACTION_FALL_PITCH_GRAVITY; // size: 0x4, address: 0x0
static float FLYACTION_DEFAULT_PITCH_GRAVITY; // size: 0x4, address: 0x0
static float FLYACTION_MIN_PITCH; // size: 0x4, address: 0x0
static float FLYACTION_MAX_PITCH; // size: 0x4, address: 0x0
static float FLYACTION_LEFT_RIGHT_ROT; // size: 0x4, address: 0x0
static float FLYACTION_UP_DOWN_ROT; // size: 0x4, address: 0x0
static float toaf32GpUsedRate[5]; // size: 0x14, address: 0x0
static float toaf32ItemBox[3]; // size: 0xC, address: 0x0
static float toaf32BonusGLink[3]; // size: 0xC, address: 0x0
static float toaf32BonusPower[6]; // size: 0x18, address: 0x0
static float toaf32BonusFly[3]; // size: 0xC, address: 0x0
static float toaf32BonusSpeed[3]; // size: 0xC, address: 0x0
static float toaf32BonusTrick[7]; // size: 0x1C, address: 0x0
enum enmRet aoeRet[3]; // size: 0xC, address: 0x655000
static unsigned char ChkComUseData[1]; // size: 0x1, address: 0x0
static unsigned char ChkCourseUseData[1]; // size: 0x1, address: 0x0
static unsigned char chk__enum__enmMotion_nakawatari_SizeOver[1]; // size: 0x1, address: 0x0
static unsigned char chk__enum__notSkateModelType_nakawatari_NotEqual[1]; // size: 0x1, address: 0x0
static unsigned char chk__enum__enmMotionType_nakawatari_SizeOver[1]; // size: 0x1, address: 0x0
static unsigned char chk__enum__enmLevel_nakawatari_SizeOver[1]; // size: 0x1, address: 0x0
static float tosUnitMatrix[4][4]; // size: 0x40, address: 0x0
static class NNS_VECTOR tosUnitScaleVec; // size: 0xC, address: 0x0
static class NNS_VECTOR tosZVec; // size: 0xC, address: 0x0
static class NNS_VECTOR tosYVec; // size: 0xC, address: 0x0
static class NNS_VECTOR tosXVec; // size: 0xC, address: 0x0
static class NNS_VECTOR tosZeroVec; // size: 0xC, address: 0x0
static class NNS_VECTORFAST tosUnitScaleVecFast; // size: 0x10, address: 0x0
static class NNS_VECTORFAST tosZVecFast; // size: 0x10, address: 0x0
static class NNS_VECTORFAST tosYVecFast; // size: 0x10, address: 0x0
static class NNS_VECTORFAST tosXVecFast; // size: 0x10, address: 0x0
static class NNS_VECTORFAST tosZeroVecFast; // size: 0x10, address: 0x0
unsigned int oau32DebugColor[16]; // size: 0x40, address: 0x655010
char * oapc8Str[2]; // size: 0x8, address: 0x5F2198
char * oapc8Str[2]; // size: 0x8, address: 0x0
char * oapc8Str[2]; // size: 0x8, address: 0x0
char * oapc8Str[2]; // size: 0x8, address: 0x5F21B0
unsigned char oau8Mask[2]; // size: 0x2, address: 0x0
unsigned short oau16Mask[2]; // size: 0x4, address: 0x0
unsigned int oau32Mask[2]; // size: 0x8, address: 0x655050
unsigned int oau32Col[2]; // size: 0x8, address: 0x655058
class Fuid fuid; // size: 0x10, address: 0x0
enum enm {
    NONE = -1,
    CHARA_0 = 0,
    ENTRY_CHARA_1 = 1,
    CHARA_SUPER_SONIC_MODEL_3 = 3,
    GEAR_10 = 10,
    ENTRY_GEAR_11 = 11,
    MAP_100 = 100,
    MAP_MISSION_101 = 101,
    MAP_SURVIVALBALL_102 = 102,
    MAP_TUTORIAL_103 = 103,
    MAP_SURVIVALBATTLE_104 = 104,
    MAP_SURVIVALRELAY_105 = 105,
    REFLECT_MAP_110 = 110,
    REFLECT_DIVMAP_111 = 111,
    MAP_BURN_LIGHT_150 = 150,
    SKY_200 = 200,
    SKY_THUNDER_250 = 250,
    START_CAMERA_MOTION_300 = 300,
    START_CAMERA_MOTION_301 = 301,
    SET_DATA_1000 = 1000,
    MISSION_DATA_1010 = 1010,
    TUTORIAL_DATA_1011 = 1011,
    GAME_2D_1020 = 1020,
    GAME_2D_1025 = 1025,
    GAME_2D_1026 = 1026,
    GAME_2D_1027 = 1027,
    MISSION_2D_1028 = 1028,
    SUVIVALBALL_2D_1029 = 1029,
    TUTORIAL_2D_1030 = 1030,
    NETRANKING_2D_1031 = 1031,
    SUVIVALBATTLE_2D_1032 = 1032,
    TIMEATTACK_2D_1033 = 1033,
    SURVIVALMESSAGE_2D_1034 = 1034,
    SUVIVALBATTLE_MAP2D_1035 = 1035,
    MISSION_STAGE_2D_1036 = 1036,
    ETC_BINARY_STAGE_DATA_1050 = 1050,
    OBJ_PORTAL_1090 = 1090,
    PATH__PLAYER_1100 = 1100,
    PATH__GIMMICK_1101 = 1101,
    PATH__RAIL_1102 = 1102,
    PATH__TRICK_1103 = 1103,
    PATH__GRAVITY_1104 = 1104,
    PATH__RANK_1105 = 1105,
    PATH__DIVE_1106 = 1106,
    PATH__COURSE_1110 = 1110,
    PATH__COM_1111 = 1111,
    TUTORIAL_GHOST_1200 = 1200,
    SET_SE_3D_1900 = 1900,
    SET_SE_2D_1901 = 1901,
    START_GIMMICK = 2000,
    START_UNION_GIMMICK = 2000,
    RING_2000 = 2000,
    ITEM_BOX_2010 = 2010,
    ITEM_BOX_AIR_2011 = 2011,
    DASH_PANEL_2020 = 2020,
    SPRING_2030 = 2030,
    DASH_RING_2040 = 2040,
    START_GATE_2050 = 2050,
    GOAL_LINE_2060 = 2060,
    TYPE_2070 = 2070,
    PT_DOOR_2080 = 2080,
    PT_DOOR_2081 = 2081,
    PT_ONLY_2082 = 2082,
    PUT_FIXEDOBJECT_2090 = 2090,
    PUT_FIXEDMOTOBJ_2091 = 2091,
    PUT_FIXEDMOTMATOBJ_2092 = 2092,
    PUT_FIXEDBURNOBJ_2093 = 2093,
    PUT_FIXEDMATOBJ_2094 = 2094,
    PUT_GRAVITYOBJ_2100 = 2100,
    PUT_MATMOTGOBJ_2101 = 2101,
    PUT_GRAVITYOBJ2_2102 = 2102,
    PUT_PARALLAX_2103 = 2103,
    PUT_GRAVITYOBJ3_2104 = 2104,
    PUT_ARROW_2105 = 2105,
    PUT_MOTIONOBJ_2110 = 2110,
    WALL_OBJ_2120 = 2120,
    CATAPULT_2130 = 2130,
    PATH_GARVITYOBJ_2140 = 2140,
    GRAVITY_RING_2150 = 2150,
    HIDE_KICKER_2160 = 2160,
    WALL_GIMMICK_2170 = 2170,
    PLAY_AROUND_SE_2180 = 2180,
    ADJUST_GCTRL_2190 = 2190,
    PLAY_LOOP_SE_2200 = 2200,
    AUTO_WALLRUN_2210 = 2210,
    MAG_BARRIRER_2220 = 2220,
    RAIL_WAY_START_2230 = 2230,
    RAIL_WAY_END_2231 = 2231,
    SPEED_DOWN_2240 = 2240,
    END_UNION_GIMMICK = 2241,
    START_GIMMICK_ST00 = 10000,
    END_GIMMICK_ST00 = 10001,
    START_GIMMICK_ST01 = 11000,
    ST01_PATH_CAR_11000 = 11000,
    ST01_PUT_CAR_11010 = 11010,
    ST01_PATH_TRAIN_11040 = 11040,
    ST01_PRODUCTION_ROBO_11050 = 11050,
    ST01_SECURITY_ROBO_11060 = 11060,
    ST01_TAXI_11080 = 11080,
    ST01_CHAIR_A_11190 = 11190,
    ST01_CHAIR_B_11191 = 11191,
    ST01_GARBAGE_BOX_11192 = 11192,
    ST01_GUIDE_BOARD_11193 = 11193,
    ST01_CONE_11194 = 11194,
    ST01_GLINK_TRAIN_11200 = 11200,
    ST01_GLINK_TRAIN_OBJECT_11201 = 11201,
    ST01_TURB_COL_11210 = 11210,
    ST01_GCTRL_TRAIN_11220 = 11220,
    ST01_GCTRL_TRAIN_OBJECT_11221 = 11221,
    END_GIMMICK_ST01 = 11222,
    START_GIMMICK_ST02 = 12000,
    ST02_IVY_12000 = 12000,
    ST02_BEE_ROBO_12010 = 12010,
    ST02_KUKI_12020 = 12020,
    ST02_PLANT_12030 = 12030,
    ST02_PLANT_12031 = 12031,
    ST02_SIDA_12040 = 12040,
    ST02_PATH_BEE_12050 = 12050,
    ST02_BUTTERFLY_12060 = 12060,
    ST02_RUN_BEE_12070 = 12070,
    END_GIMMICK_ST02 = 12071,
    START_GIMMICK_ST03 = 13000,
    ST03_COGWHEEL_13000 = 13000,
    ST03_PRESS_13010 = 13010,
    ST03_EXTRALAMP_13020 = 13020,
    ST03_PUT_ROBO_13030 = 13030,
    ST03_PUT_CONTAINER_13040 = 13040,
    ST03_SECURITY_GATE_13050 = 13050,
    ST03_POWER_BREAK_13060 = 13060,
    ST03_MACROSS_13070 = 13070,
    ST03_PATH_ROBO_13090 = 13090,
    END_GIMMICK_ST03 = 13091,
    START_GIMMICK_ST04 = 14000,
    ST04_AUTORUN_CANOE_14000 = 14000,
    ST04_GLINK_WATERSPHERE_14010 = 14010,
    ST04_FOUNTAIN_14020 = 14020,
    ST04_STRAIGHT_FOUNTAIN_14030 = 14030,
    ST04_PATH_CANOE_14040 = 14040,
    ST04_WATER_TURBULENCE_14050 = 14050,
    ST04_PUT_CANOE_14060 = 14060,
    ST04_SMALL_WATERSPHERE_14070 = 14070,
    END_GIMMICK_ST04 = 14071,
    START_GIMMICK_ST05 = 15000,
    ST05_ROT_GROUND_15000 = 15000,
    ST05_ROT_FALL_MANAGER_15010 = 15010,
    ST05_ROT_FALL_OBJECT_15011 = 15011,
    ST05_FIRE_15020 = 15020,
    ST05_SPAIN_15030 = 15030,
    ST05_DOMINO_15040 = 15040,
    ST05_ROT_FALL_GLINK_MANAGER_15050 = 15050,
    ST05_ROT_FALL_GLINK_OBJECT_15051 = 15051,
    ST05_DETENTION_15060 = 15060,
    ST05_BREAK_RAILING_15070 = 15070,
    END_GIMMICK_ST05 = 15071,
    START_GIMMICK_ST06 = 16000,
    ST06_SURVEILLANCE_CAMERA_16000 = 16000,
    ST06_BLOCKADEOBJ_16010 = 16010,
    ST06_LASER_16020 = 16020,
    ST06_GLINK_ELEVATOR_16030 = 16030,
    ST06_ELEVATOR_16040 = 16040,
    END_GIMMICK_ST06 = 16041,
    START_GIMMICK_ST07 = 17000,
    ST07_FLOOR_S_17000 = 17000,
    ST07_FLOOR_B_17001 = 17001,
    ST07_FLOOR_SWITCH_17002 = 17002,
    ST07_FLOOR_CHANGE_17003 = 17003,
    ST07_FLOOR_KICKER_17004 = 17004,
    ST07_FLOOR_GRAVITY_17005 = 17005,
    ST07_FLOOR_GLINK_17006 = 17006,
    ST07_JOINT00_17010 = 17010,
    ST07_JOINT01_17011 = 17011,
    ST07_JOINT02_17012 = 17012,
    ST07_JOINT03_17013 = 17013,
    ST07_GUARDRAIL00_17020 = 17020,
    ST07_GUARDRAIL01_17021 = 17021,
    ST07_GIMMICKWALL00_17030 = 17030,
    ST07_GIMMICKWALL01_17031 = 17031,
    ST07_GATE_17050 = 17050,
    ST07_WALL_THROUGH_17060 = 17060,
    ST07_POWER_BREAK_17070 = 17070,
    ST07_SOLAR_17080 = 17080,
    END_GIMMICK_ST07 = 17081,
    START_GIMMICK_ST08 = 18000,
    ST08_ROAD_18000 = 18000,
    ST08_ROAD_SIGNAL_18010 = 18010,
    ST08_ROAD_CAR_18020 = 18020,
    ST08_ROAD_GLINK_BUS_18030 = 18030,
    ST08_ROAD_TRAILER_18040 = 18040,
    ST08_ROAD_CONTAINER_18041 = 18041,
    ST08_UFOCATCHER_18050 = 18050,
    ST08_FZONE_ENEMY_18060 = 18060,
    END_GIMMICK_ST08 = 18061,
    START_GIMMICK_ST09 = 19000,
    END_GIMMICK_ST09 = 19001,
    START_GIMMICK_ST10 = 20000,
    ST10_SNOWBALL_20010 = 20010,
    ST10_FALL_SNOWBALL_20020 = 20020,
    ST10_SNOWMAN_20030 = 20030,
    ST10_LIFT_20040 = 20040,
    END_GIMMICK_ST10 = 20041,
    START_GIMMICK_ST11 = 21000,
    ST11_ENERGY_CYLINDER_21000 = 21000,
    ST11_FSECURITY_GATE_21010 = 21010,
    ST11_PATH_SECURITY_ROBO_21020 = 21020,
    ST11_FAN_21030 = 21030,
    ST11_CRANE_21040 = 21040,
    ST11_GLINK_CYLINDER_21050 = 21050,
    ST11_LINE_OBJ_21060 = 21060,
    END_GIMMICK_ST11 = 21061,
    START_GIMMICK_ST12 = 22000,
    ST12_GLINK_BRIDGE_22010 = 22010,
    ST12_PUT_CANOE_22020 = 22020,
    ST12_PATH_CANOE_22030 = 22030,
    ST12_MOTIONOBJ_22040 = 22040,
    END_GIMMICK_ST12 = 22041,
    START_GIMMICK_ST13 = 23000,
    ST13_BUNKI_23010 = 23010,
    ST13_CATAPULT_23020 = 23020,
    ST13_COLOSSUS_23030 = 23030,
    ST13_GLINK_COLOSSUS_23040 = 23040,
    ST13_BRIDGE_23050 = 23050,
    ST13_GATE_23060 = 23060,
    ST13_PILLAR_23070 = 23070,
    ST13_PT_OBJ_23080 = 23080,
    ST13_HIKARI_23090 = 23090,
    ST13_SIGNBOARD_23100 = 23100,
    ST13_SIGNBOARD_B_23110 = 23110,
    ST13_PT_WALL_23120 = 23120,
    END_GIMMICK_ST13 = 23121,
    START_GIMMICK_ST14 = 24000,
    ST14_FAN_24000 = 24000,
    ST14_OBJ_CRANE_24010 = 24010,
    ST14_LASER_24020 = 24020,
    ST14_BIG_FAN_24030 = 24030,
    ST14_STEEL_FRAME_24040 = 24040,
    END_GIMMICK_ST14 = 24041,
    START_GIMMICK_ST15 = 25000,
    ST15_CORE_BASE_25000 = 25000,
    ST15_FUSION_MACHINE_25010 = 25010,
    ST15_ENERGY_BULLET_25020 = 25020,
    ST15_METEORITE_L_25030 = 25030,
    ST15_METEORITE_S_25040 = 25040,
    ST15_BLACK_HOLE_25050 = 25050,
    ST15_GLINK_FLOOR_BOARD_25060 = 25060,
    ST15_BREAK_FLOOR_25070 = 25070,
    ST15_FLOATING_METEORITE_25080 = 25080,
    ST15_FLOATING_METEO_TRIG_25090 = 25090,
    ST15_SAFE_TRAMPOLINE_25100 = 25100,
    END_GIMMICK_ST15 = 25101,
    START_GIMMICK_ST16 = 26000,
    ST16_HELICOPTER_26000 = 26000,
    ST16_HELICOPTER_OBJ_26001 = 26001,
    ST16_GLINK_SIGNBOARD_26010 = 26010,
    ST16_BREAK_SIGNBOARD_26020 = 26020,
    ST16_AUTORUN_HELI_26030 = 26030,
    END_GIMMICK_ST16 = 26031,
    START_GIMMICK_MISSION = 27000,
    MISSION_PATH_TARGET_27000 = 27000,
    MISSION_TIME_GATE_27010 = 27010,
    MISSION_MARK_27011 = 27011,
    MISSION_PATH_ROBO_27020 = 27020,
    MISSION_FIXED_LINK_27030 = 27030,
    MISSION_GLINK_COLOSSUS_27040 = 27040,
    END_GIMMICK_MISSION = 27041,
    START_GIMMICK_SURVIVALBALL = 28000,
    SURVIVALBALL_GOALRING_28000 = 28000,
    SURVIVALBALL_BALL_28010 = 28010,
    SURVIVALBALL_POLE_28020 = 28020,
    SURVIVALBALL_START_28030 = 28030,
    SURVIVALBALL_PUT_OBJ_28040 = 28040,
    END_GIMMICK_SURVIVALBALL = 28041,
    START_GIMMICK_SURVIVALRELAY = 28500,
    SURVIVALRELAY_WALKRUN_28500 = 28500,
    END_GIMMICK_SURVIVALRELAY = 28501,
    START_GIMMICK_SURVIVALBATTLE = 29000,
    SURVIVALBATTLE_MISSILE_29000 = 29000,
    SURVIVALBATTLE_BOMB_29010 = 29010,
    SURVIVALBATTLE_BLOCK_29020 = 29020,
    SURVIVALBATTLE_POLE_29030 = 29030,
    SURVIVALBATTLE_BARRIER_29040 = 29040,
    SURVIVALBATTLE_EXPLOSION_29050 = 29050,
    END_GIMMICK_SURVIVALBATTLE = 29051,
    END_GIMMICK = 29052,
    EFFECT_30000 = 30000,
    EFFECT_GRAVITY_30010 = 30010,
    EFFECT_GRAVITY_30020 = 30020,
    EFFECT_GRAVITY2_30021 = 30021,
    EFFECT_SUNLENZ_30030 = 30030,
    EFFECT_LANDING_30040 = 30040,
    EFFECT_CURVEAIR_30050 = 30050,
    EFFECT_CRASH_30060 = 30060,
    EFFECT_DASH_30070 = 30070,
    EFFECT_GETAGP_30080 = 30080,
    EFFECT_FLLWLINE_30090 = 30090,
    EFFECT_CRASHC_30100 = 30100,
    EFFECT_BADTRK_30110 = 30110,
    EFFECT_GEARCH01_30120 = 30120,
    EFFECT_GEARCH02_30130 = 30130,
    EFFECT_GEARCH03_30140 = 30140,
    EFFECT_GEARCHRT_30150 = 30150,
    EFFECT_FALSESTART00_30170 = 30170,
    EFFECT_FALSESTART01_30180 = 30180,
    EFFECT_GCTRL_00_30190 = 30190,
    EFFECT_GCTRL_01_30200 = 30200,
    EFFECT_GCTRL_02_30210 = 30210,
    EFFECT_MIST_30230 = 30230,
    EFFECT_ST02_SIDARIDE_30240 = 30240,
    EFFECT_ST01_ROBOCURV_30250 = 30250,
    EFFECT_MINIWAVE_30260 = 30260,
    EFFECT_BACKRIBBON_30270 = 30270,
    EFFECT_GIMICKLINE_30280 = 30280,
    EFFECT_LANDINGWATERTRICK_30290 = 30290,
    EFFECT_LANDINGWATERTRICK_30300 = 30300,
    EFFECT_WAVYTEXTURE_30310 = 30310,
    EFFECT_ST11_DISELECTRIC_30320 = 30320,
    EFFECT_REFRECT_PLANE_START_30330 = 30330,
    EFFECT_REFRECT_PLANE_END_30339 = 30339,
    EFFECT_ST15_METEOFALL_30340 = 30340,
    EFFECT_ST15_DIVEEFFECT_30350 = 30350,
    EFFECT_ST15_METEO_EXPLODE_30360 = 30360,
    EFFECT_ST15_BOSS_CRUSH_30370 = 30370,
    EFFECT_ST15_BOSS_CRUSH2_30371 = 30371,
    EFFECT_POWER_HIT_30380 = 30380,
    EFFECT_ST15_BOSS_APPEAR_30390 = 30390,
    EFFECT_TRICK_X_FLASHLINE_30400 = 30400,
    EFFECT_TRICK_X_RING_30410 = 30410,
    EFFECT_ST07_BORN_RING_30420 = 30420,
    EFFECT_ST07_PTOBJ_30430 = 30430,
    EFFECT_ST07_FLOOR_30440 = 30440,
    EFFECT_ST07_FLOOR_G_30450 = 30450,
    EFFECT_ST07_BORN_SPRING_30460 = 30460,
    EFFECT_ST14_FAN_L_EFFECT_30470 = 30470,
    EFFECT_ST14_FAN_S_EFFECT_30480 = 30480,
    EFFECT_ST07_BORN_ITEMBOX_30490 = 30490,
    EFFECT_ST07_BORN_DPANEL_30500 = 30500,
    EFFECT_GC_EMPTY_EFFECT_30510 = 30510,
    EFFECT_ST07_FLOOR_HOLE_30520 = 30520,
    EFFECT_LOCKON_MOT = 30530,
    EFFECT_LOCKON_MATMOT = 30531,
    EFFECT_GRAVITY_LO_30540 = 30540,
    EFFECT_ATTACK_BOOST_30610 = 30610,
    EFFECT_GEARCH_TYPE_30620 = 30620,
    PARTICLE_32000 = 32000,
    PARTICLE_32001 = 32001,
    PARTICLE_32100 = 32100,
    PARTICLE_UNION_32100 = 32100,
    PARTICLE_32999 = 32999,
    PARTICLE_GAME_32500 = 32500,
    PARTICLE_MODE_32550 = 32550,
    PARTICLE_SET_33000 = 33000,
    PARTICLE_33000 = 33000,
    PARTICLE_33999 = 33999,
    SCRIPT_SURVIVAL_DATA_START = 34000,
    SURVIVAL_DATA_BALLPOS_34000 = 34000,
    SCRIPT_SURVIVAL_DATA_END = 34001,
    SCRIPT_BINARY_START = 35000,
    SCRIPT_BINARY_35000 = 35000,
    SCRIPT_BINARY_END = 35049,
    SCRIPT_MODEL_START = 35050,
    SCRIPT_MODEL_35050 = 35050,
    SCRIPT_MODEL_MOT_35060 = 35060,
    SCRIPT_MODEL_MAT_35070 = 35070,
    SCRIPT_MODEL_MOT_MAT_35080 = 35080,
    SCRIPT_MODEL_MAT_MOF_35090 = 35090,
    SCRIPT_MODEL_MOT_MAT_MOF_35100 = 35100,
    SCRIPT_MODEL_MOF_35110 = 35110,
    SCRIPT_MODEL_FRAMETEX_35120 = 35120,
    SCRIPT_MODEL_MOTIONDATA_35130 = 35130,
    SCRIPT_MODEL_MATMOTIONDATA_35140 = 35140,
    SCRIPT_MODEL_MORFMOTIONDATA_35150 = 35150,
    SCRIPT_NT_MODEL_35160 = 35160,
    SCRIPT_NT_MODEL_MOT_35170 = 35170,
    SCRIPT_NT_MODEL_MAT_35180 = 35180,
    SCRIPT_NT_MODEL_MOT_MAT_35190 = 35190,
    SCRIPT_MODEL_END = 35249,
    SCRIPT_CAMERA_START = 35250,
    SCRIPT_CAMERAMOTIOM_35250 = 35250,
    SCRIPT_FRAMETEX_CAM_MOTION_35260 = 35260,
    SCRIPT_LIGHTMOTIOM_35270 = 35270,
    SCRIPT_CAMERA_END = 35299,
    SCRIPT_EFFECT_START = 35300,
    SCRIPT_DATA_EFFECT_35300 = 35300,
    SCRIPT_DATA_EFFECT_MAT_35310 = 35310,
    SCRIPT_SHADOW_35320 = 35320,
    SCRIPT_SHADOW_35321 = 35321,
    SCRIPT_EFFECT_GRAVITY_35330 = 35330,
    SCRIPT_DATA_SUNLENZ_35340 = 35340,
    SCRIPT_EFFECT_END = 37499,
    SCRIPT_ETC_START = 37500,
    SCRIPT_2D_37510 = 37510,
    SCRIPT_FONT_DATA_37520 = 37520,
    SCRIPT_ETC_END = 37999,
    NONSETOBJECT_START = 38000,
    ITEMTRAP_BOMB_38001 = 38001,
    NONSETOBJECT_END = 38999,
    STORY_LOADING_45000 = 45000,
    STORY_2D_45001 = 45001,
    TITLE_SELECT_50000 = 50000,
    FONT_DATA_50010 = 50010,
    FONT_MISSION_DATA_50020 = 50020,
    FONT_MENUDATA_50030 = 50030,
    FONT_USERNAME_DATA_50040 = 50040,
    FONT_BTN_DATA_50050 = 50050,
    FONT__DATA_PECULIAR_50060 = 50060,
    ADVERTISE_FLASH_TEXTURE_52000 = 52000,
    ADVERTISE_FLASH_DATA_52005 = 52005,
    ADVERTISE_BG_MODEL_52006 = 52006,
    ADVERTISE_CS_GEARPARTS_52010 = 52010,
    CHARACTER_SELECT_FLASHTEX_52020 = 52020,
    CHARACTER_SELECT_FLASH_52025 = 52025,
    MAIN_MENU_SELECT_FLASHTEX_52030 = 52030,
    MAIN_MENU_SELECT_FLASH_52035 = 52035,
    TITLE_FLASHTEX_52040 = 52040,
    TITLE_FLASH_52045 = 52045,
    ENTRY_MODEL_UNI_MOT_52050 = 52050,
    ENTRY_MODEL_EGG_MOT_52060 = 52060,
    ENTRY_MODEL_ROBO_MOT_52070 = 52070,
    EXTRA_MENU_SELECT_FLASHTEX_52080 = 52080,
    EXTRA_MENU_SELECT_FLASH_52085 = 52085,
    EXTRA_MENU_UNION_FLASH_52086 = 52086,
    OPTION_MENU_SELECT_FLASHTEX_52090 = 52090,
    OPTION_MENU_SELECT_FLASHTEX_52091 = 52091,
    OPTION_MENU_SELECT_FLASHTEX_52092 = 52092,
    OPTION_MENU_SELECT_FLASHTEX_52093 = 52093,
    OPTION_MENU_SELECT_FLASHTEX_52094 = 52094,
    OPTION_MENU_SELECT_FLASHTEX_52095 = 52095,
    OPTION_MENU_BACK_FLASH_52098 = 52098,
    OPTION_MENU_SELECT_FLASH_52099 = 52099,
    TITLE_LOGO_52100 = 52100,
    SAVEDATA_52110 = 52110,
    SAVEDATA_52111 = 52111,
    SAVEDATA_52112 = 52112,
    SAVEDATA_52113 = 52113,
    SAVEDATA_52114 = 52114,
    SAVEDATA_52115 = 52115,
    SHOPDATA_52120 = 52120,
    SHOPCHAO_52130 = 52130,
    SHOPOBJ_52140 = 52140,
    GEARGALLERY_52150 = 52150,
    KEYBOARD_2D_53000 = 53000,
    SAVE_DATA_FILE_53100 = 53100,
    SAVE_DATA_FILE_53101 = 53101,
    TEST = 60000,
    SHADOW_TEST_60010 = 60010,
    ___DUMMY__MOTION = 65500,
    DUMMY_DATA = 65501,
};



